Sommerskriptum.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="de" xml:lang="de">
<head>
<title>SommerSkriptum Info 5</title>
<!-- 2020-07-12 So 14:54 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Peter Ostertag" />

</head>
<body>
<div id="content">
<h1 class="title">SommerSkriptum Info 5</h1>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Intro</h2>
<div class="outline-text-2" id="text-1">
<p>
Liebe Quereinsteiger!
</p>

<p>
Auf dieser Website möchte ich alle Infos versammeln, die man braucht, um in der 6. Klasse in Informatik einzusteigen!
</p>

<p>
Ihr könnte mir jederzeit ein Email <i>ostertag.heinz@borgnonntal.at</i> schicken, ich kann allerdings im Sommer nicht garantieren, dass die Antwort innerhalb eines Tages erfolgt. Aber baldmöglich!
</p>
</div>
</div>


<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> HTML</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Editoren</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Zum Schreiben von HTML (und anderen Programmiersprachen) braucht man einen &bdquo;Editor&ldquo;. Davon gibt es viele, wir verwenden in der Schule die beiden folgenden:
</p>

<ul class="org-ul">
<li><a href="https://notepad-plus-plus.org/">Notepad++</a>: unser altes Modell, gut aber ohne Luxus
</li>
<li><a href="https://code.visualstudio.com/">Visual Studio Code</a>: neues Modell: spielt alle Stückerln (Syntax Highlighting, automatische Vorschläge und Ergänzungen)
</li>
</ul>

<p>
Bei beiden ist wichtig, dass man schnell mit der Endung .html abspeichert, sonst weiß das Programm nicht, worum es geht und kann nicht helfen.
</p>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Skriptum</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Das Skriptum ist leider nicht vollständig, ich habe es nicht konsequent geschrieben.
<a href="html.html">Zum Skriptum</a>
</p>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Hilfewebseiten</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li><a href="https://selfhtml.org/">Selfhtml</a>: dieses Nachschlagewerk dürfen wir auch im Unterricht, bei den Schularbeiten verwenden!
</li>
<li><a href="https://www.w3schools.com/">w3schools.com</a>: das ist quasi die offizielle Hilfe. Hier gibt&rsquo;s auch die Möglichkeiten, interaktiv etwas auszuprobieren!
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Binärsystem</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li><a href="Binaersystem.html">Skriptum</a>: Kapitel Binärsystem
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Anderes</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Datum: Schuljahr 2019/20</p>
<p class="author">Autor: Peter Ostertag</p>
<p class="date">Created: 2020-07-12 So 14:54</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.2.2 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
